; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 8 parts and 150% wood
; Machines:
;   3 highspeed-saw
;   3 glazer
;   3 grinder
;   3 immersion-varnisher
;   3 planer
;   3 saw
;   3 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 highspeed-saw2 - highspeed-saw
    glazer0 glazer1 glazer2 - glazer
    grinder0 grinder1 grinder2 - grinder
    immersion-varnisher0 immersion-varnisher1 immersion-varnisher2 - immersion-varnisher
    planer0 planer1 planer2 - planer
    saw0 saw1 saw2 - saw
    spray-varnisher0 spray-varnisher1 spray-varnisher2 - spray-varnisher
    white mauve green blue red black - acolour
    pine teak - awood
    p0 p1 p2 p3 p4 p5 p6 p7 - part
    b0 b1 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (empty highspeed-saw2)
    (has-colour glazer0 black)
    (has-colour glazer0 red)
    (has-colour glazer1 natural)
    (has-colour glazer1 black)
    (has-colour glazer2 mauve)
    (has-colour immersion-varnisher0 black)
    (has-colour immersion-varnisher1 mauve)
    (has-colour immersion-varnisher1 natural)
    (has-colour immersion-varnisher1 red)
    (has-colour immersion-varnisher2 black)
    (has-colour spray-varnisher0 mauve)
    (has-colour spray-varnisher0 red)
    (has-colour spray-varnisher1 black)
    (has-colour spray-varnisher2 natural)
    (has-colour spray-varnisher2 black)
    (available p0)
    (treatment p0 varnished)
    (surface-condition p0 rough)
    (wood p0 teak)
    (colour p0 green)
    (goalsize p0 small)
    (= (spray-varnish-cost p0) 5)
    (= (glaze-cost p0) 10)
    (= (grind-cost p0) 15)
    (= (plane-cost p0) 10)
    (available p1)
    (treatment p1 glazed)
    (surface-condition p1 smooth)
    (wood p1 teak)
    (colour p1 white)
    (goalsize p1 large)
    (= (spray-varnish-cost p1) 15)
    (= (glaze-cost p1) 20)
    (= (grind-cost p1) 45)
    (= (plane-cost p1) 30)
    (available p2)
    (treatment p2 varnished)
    (surface-condition p2 verysmooth)
    (wood p2 teak)
    (colour p2 green)
    (goalsize p2 medium)
    (= (spray-varnish-cost p2) 10)
    (= (glaze-cost p2) 15)
    (= (grind-cost p2) 30)
    (= (plane-cost p2) 20)
    (unused p3)
    (goalsize p3 small)
    (= (spray-varnish-cost p3) 5)
    (= (glaze-cost p3) 10)
    (= (grind-cost p3) 15)
    (= (plane-cost p3) 10)
    (unused p4)
    (goalsize p4 medium)
    (= (spray-varnish-cost p4) 10)
    (= (glaze-cost p4) 15)
    (= (grind-cost p4) 30)
    (= (plane-cost p4) 20)
    (unused p5)
    (goalsize p5 medium)
    (= (spray-varnish-cost p5) 10)
    (= (glaze-cost p5) 15)
    (= (grind-cost p5) 30)
    (= (plane-cost p5) 20)
    (unused p6)
    (goalsize p6 medium)
    (= (spray-varnish-cost p6) 10)
    (= (glaze-cost p6) 15)
    (= (grind-cost p6) 30)
    (= (plane-cost p6) 20)
    (unused p7)
    (goalsize p7 medium)
    (= (spray-varnish-cost p7) 10)
    (= (glaze-cost p7) 15)
    (= (grind-cost p7) 30)
    (= (plane-cost p7) 20)
    (boardsize b0 s5)
    (wood b0 pine)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s9)
    (wood b1 teak)
    (surface-condition b1 smooth)
    (available b1)
  )
  (:goal
    (and
    (available p0)
    (treatment p0 glazed)
    (surface-condition p0 verysmooth)
    (available p1)
    (colour p1 natural)
    (surface-condition p1 smooth)
    (available p2)
    (wood p2 teak)
    (colour p2 mauve)
    (available p3)
    (wood p3 pine)
    (colour p3 black)
    (treatment p3 glazed)
    (surface-condition p3 verysmooth)
    (available p4)
    (wood p4 teak)
    (colour p4 red)
    (available p5)
    (colour p5 black)
    (treatment p5 varnished)
    (available p6)
    (wood p6 teak)
    (treatment p6 varnished)
    (available p7)
    (wood p7 pine)
    (colour p7 black)
    (treatment p7 glazed)
    (surface-condition p7 verysmooth)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-small b0 p3 saw0 pine rough s5 s4)
   deleted: (unused p3)
   added: (available p3) (wood p3 pine) (surface-condition p3 rough) (colour p3 natural) (treatment p3 untreated) (boardsize b0 s4)
   goals met: 7 of 28
2. (do-plane p3 planer0 rough natural untreated)
   deleted: (surface-condition p3 rough)
   added: (surface-condition p3 smooth)
   goals met: 7 of 28
3. (do-plane p2 planer0 verysmooth green varnished)
   deleted: (surface-condition p2 verysmooth) (treatment p2 varnished) (colour p2 green)
   added: (surface-condition p2 smooth) (treatment p2 untreated) (colour p2 natural)
   goals met: 7 of 28
4. (do-plane p0 planer0 rough green varnished)
   deleted: (surface-condition p0 rough) (treatment p0 varnished) (colour p0 green)
   added: (surface-condition p0 smooth) (treatment p0 untreated) (colour p0 natural)
   goals met: 7 of 28
5. (do-grind p3 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p3 smooth)
   added: (surface-condition p3 verysmooth)
   goals met: 8 of 28
6. (do-grind p0 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p0 smooth)
   added: (surface-condition p0 verysmooth)
   goals met: 9 of 28
7. (do-glaze p3 glazer0 black)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 black)
   goals met: 11 of 28
8. (do-glaze p2 glazer2 mauve)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 glazed) (colour p2 mauve)
   goals met: 12 of 28
9. (do-glaze p0 glazer0 black)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 glazed) (colour p0 black)
   goals met: 13 of 28
10. (do-plane p1 planer0 smooth white glazed)
   deleted: (treatment p1 glazed) (colour p1 white)
   added: (treatment p1 untreated) (colour p1 natural)
   goals met: 14 of 28
11. (do-saw-medium b0 p7 saw0 pine rough s4 s3 s2)
   deleted: (unused p7)
   added: (available p7) (wood p7 pine) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b0 s2)
   goals met: 16 of 28
12. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 16 of 28
13. (do-grind p7 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p7 smooth)
   added: (surface-condition p7 verysmooth)
   goals met: 17 of 28
14. (do-glaze p7 glazer0 black)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 glazed) (colour p7 black)
   goals met: 19 of 28
15. (do-saw-medium b1 p4 saw0 teak smooth s9 s8 s7)
   deleted: (unused p4)
   added: (available p4) (wood p4 teak) (surface-condition p4 smooth) (colour p4 natural) (treatment p4 untreated) (boardsize b1 s7)
   goals met: 21 of 28
16. (do-glaze p4 glazer0 red)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 glazed) (colour p4 red)
   goals met: 22 of 28
17. (do-saw-medium b1 p5 saw0 teak smooth s7 s6 s5)
   deleted: (unused p5)
   added: (available p5) (wood p5 teak) (surface-condition p5 smooth) (colour p5 natural) (treatment p5 untreated) (boardsize b1 s5)
   goals met: 23 of 28
18. (do-immersion-varnish p5 immersion-varnisher0 black smooth)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 varnished) (colour p5 black)
   goals met: 25 of 28
19. (do-saw-medium b1 p6 saw0 teak smooth s5 s4 s3)
   deleted: (unused p6)
   added: (available p6) (wood p6 teak) (surface-condition p6 smooth) (colour p6 natural) (treatment p6 untreated) (boardsize b1 s3)
   goals met: 27 of 28
20. (do-immersion-varnish p6 immersion-varnisher0 black smooth)
   deleted: (treatment p6 untreated) (colour p6 natural)
   added: (treatment p6 varnished) (colour p6 black)
   goals met: 28 of 28
